simple_contact_book/app/controllers/contact_list_controller.rb

    def index
        @contactList = ContactList.all
---
SELECT "contact_lists".* FROM "contact_lists"

    def show
        @contactList = ContactList.find(params[:id])
---
SELECT "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @contactList = ContactList.create(
            list_name: params[:list_name],
        )
---
INSERT INTO "contact_lists" ("list_name") VALUES ($1) RETURNING "id"  [["list_name", "Work"]]

    def destroy
        @contactLists = ContactList.all
        @contactList = ContactList.find(params[:id])
        @contactList.destroy
---
SELECT "contact_lists".* FROM "contact_lists"
SELECT "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "contact_lists" WHERE "contact_lists"."id" = $1  [["id", 2]]