simple_contact_book/app/controllers/contact_controller.rb

SELECT "contacts".* FROM "contacts"
---
    def index
        @contact = Contact.all

INSERT INTO "contacts" ("contact_lists_id", "name", "phone_number", "phone_type") VALUES ($1, $2, $3, $4) RETURNING "id"  [["contact_lists_id", 1], ["name", "Fulano"], ["phone_number", "999999999"], ["phone_type", "Fax"]]
---
    def create
        @new_contact = Contact.create!(
            name: params[:name],
            phone_type: params[:phone_type],
            phone_number: params[:phone_number],
            contact_lists_id: params[:contact_lists_id],
        )